
[
    { "id": "dfy-1", "title": "3 'Healthy' Foods That Are Actually Scams", "hook": "You won't believe what's hiding in your 'healthy' snacks...", "script": "VOICEOVER: You think you're eating healthy? Think again.\n[SCENE]: A vibrant, colorful shot of a fruit yogurt parfait. Looks delicious.\n[SOUND EFFECT: record scratch]\nON-SCREEN TEXT: High in Sugar!\nVOICEOVER: This is packed with more sugar than a candy bar. The 'fruit' is basically jam.\n[SCENE]: A hand grabbing a handful of granola from a bag.\nON-SCREEN TEXT: Mostly Processed Oats & Oil!\nVOICEOVER: And this 'wholesome' granola? It's basically dessert, coated in oil and sugar.\n[SCENE]: A bag of veggie chips next to actual vegetables.\nVOICEOVER: Don't even get me started on these. They're just potato chips in disguise with a sprinkle of vegetable powder. \nON-SCREEN TEXT: Follow for more health truths.", "tone": "Shocking", "niche": "Weight Loss" },
    { "id": "dfy-2", "title": "The Easiest Side Hustle You Can Start TODAY", "hook": "I made $200 last weekend with this simple side hustle...", "script": "VOICEOVER: Stop scrolling and start earning. \n[SCENE]: Show a person cleaning a slightly dirty car headlight with a microfiber towel.\n[CAMERA ANGLE: Close-up on the yellow, hazy grime]\nVOICEOVER: This is headlight restoration. You can buy a kit for $20 online.\n[SCENE]: A super satisfying before-and-after shot of a crystal clear headlight.\n[SOUND EFFECT: Sparkle]\nVOICEOVER: And you can charge $50 per car for 30 minutes of work. That's $100 an hour for making cars safer and look better.\nON-SCREEN TEXT: Want more side hustles? Link in bio!", "tone": "Educational", "niche": "Make Money" },
    { "id": "dfy-3", "title": "This Fitness Myth is Destroying Your Progress", "hook": "If you're still doing hours of cardio, you need to see this.", "script": "VOICEOVER: You've been told cardio is the key to fat loss. You've been lied to.\n[SCENE]: Show someone looking exhausted and bored on a treadmill in black and white.\nON-SCREEN TEXT: Endless Cardio = High Cortisol\nVOICEOVER: Endless cardio can actually raise your cortisol levels, a stress hormone that makes you store MORE belly fat.\n[SCENE]: Show a person lifting weights, looking powerful and focused, in full color.\nON-SCREEN TEXT: Strength Training = Higher Metabolism\nVOICEOVER: Prioritize strength training to build muscle. More muscle burns more calories 24/7, even when you're resting. Your body will thank you.", "tone": "Data-Driven", "niche": "Fitness" },
    { "id": "dfy-4", "title": "The 5-Second Rule to Stop Procrastinating", "hook": "This simple trick will change your life.", "script": "VOICEOVER: The moment you feel yourself hesitating to do something you know you should do... \n[SCENE]: A person staring at a laptop, hesitating to start work. The world is in slow motion.\nVOICEOVER: ...count backwards. 5-4-3-2-1. And when you hit 1, MOVE.\n[SCENE]: The person physically pushes back from the table and stands up at normal speed.\n[SOUND EFFECT: Whoosh]\nVOICEOVER: This interrupts your brain's habit of making excuses and forces you into action. It's a mental trick to launch yourself. Try it now.", "tone": "Inspirational", "niche": "Productivity" },
    { "id": "dfy-5", "title": "Unboxing the new AI Pin That's Replacing Phones", "hook": "Is this the end of the iPhone?", "script": "VOICEOVER: This little device right here? It might just replace your smartphone.\n[SCENE]: A clean, aesthetic unboxing of the Humane AI Pin, showing its sleek design.\nVOICEOVER: It has no screen. You just talk to it. It has a camera, a projector, and it's powered by AI.\n[SCENE]: Demonstrating a feature, like holding up a piece of fruit and the pin projecting nutritional info onto their hand.\nON-SCREEN TEXT: '105 Calories, 27g Carbs'\nVOICEOVER: The future is weird, but I'm here for it. Full review coming soon.", "tone": "Tech", "niche": "Tech" },
    { "id": "dfy-6", "title": "IKEA Hack: Turn a $20 Shelf into a Masterpiece", "hook": "Don't buy this, HACK it.", "script": "VOICEOVER: Don't just build your IKEA furniture, transform it.\n[SCENE]: Show a basic, boring IKEA 'KALLAX' shelf unit.\nON-SCREEN TEXT: Boring Kallax Shelf: $20\nVOICEOVER: We're taking this shelf and making it look custom. You'll need paint, fluted wood trim, and a good adhesive.\n[SCENE]: A satisfying timelapse of painting the shelf and precisely attaching the trim, all set to upbeat music.\n[ACTION: Show the final product, now looking like a high-end designer piece of furniture.]\nVOICEOVER: And just like that... a custom piece that looks like it's from a high-end store.", "tone": "DIY", "niche": "DIY" },
    { "id": "dfy-7", "title": "Crypto Investing for Absolute Beginners (in 60s)", "hook": "Here's everything you need to know to start investing in crypto.", "script": "VOICEOVER: Crypto seems confusing, right? Let's fix that. \n[SCENE]: Show logos of trusted crypto exchanges like Coinbase or Kraken on a phone screen.\nON-SCREEN TEXT: Step 1: Use a Trusted Exchange\nVOICEOVER: Download a major, trusted exchange. This is where you buy.\n[SCENE]: Show the logos of Bitcoin and Ethereum prominently.\nON-SCREEN TEXT: Step 2: Start with the 'Blue Chips'\nVOICEOVER: For your first buys, stick with the big two: Bitcoin and Ethereum. They're the most established.\n[SCENE]: A screen recording of someone setting up a recurring buy for a small amount, like $25.\nON-SCREEN TEXT: Step 3: Dollar-Cost Average\nVOICEOVER: Buy a small, fixed amount every week or month. Don't try to time the market. This is the safest way to start. You're welcome.", "tone": "Educational", "niche": "Make Money" },
    { "id": "dfy-8", "title": "The Perfect Steak Secret They Don't Teach You", "hook": "Restaurant-quality steak at home is easier than you think. You're just missing one step.", "script": "VOICEOVER: You want a perfect crust on your steak, right? But it always comes out grey and sad.\n[SCENE]: A sad-looking grey steak in a pan.\nVOICEOVER: The secret isn't a hotter pan. It's a DRYER steak.\n[SCENE]: Show a raw steak. Pat it completely dry with paper towels. You should see no moisture.\nON-SCREEN TEXT: Pat it DRY. Bone dry.\nVOICEOVER: Get your pan smoking hot with a high-temp oil like avocado oil. Sear for 90 seconds per side.\n[SCENE]: A satisfying sizzle as the dry steak hits the hot pan. A beautiful brown crust forms instantly.\nVOICEOVER: Then, lower the heat, add butter, garlic, and thyme, and baste it for another minute.\n[SCENE]: A beautiful, perfectly cooked steak being sliced, with a juicy pink center.\nON-SCREEN TEXT: Dry Surface = Perfect Crust.\nVOICEOVER: Now you know.", "tone": "Educational", "niche": "Cooking", "isNew": true },
    { "id": "dfy-9", "title": "Secret 'Elden Ring' Wall You've Walked Past 100 Times", "hook": "There's a secret wall in Elden Ring that 99% of players miss.", "script": "VOICEOVER: Okay, Tarnished, listen up. I guarantee you've missed this.\n[SCENE]: Player character is in the Volcano Manor, near the Guest Hall site of grace.\nVOICEOVER: Go to the Guest Hall grace in Volcano Manor. Walk into this room here...\n[SCENE]: The player walks into the large dining room with the long table.\nON-SCREEN TEXT: Volcano Manor - Guest Hall\nVOICEOVER: Everyone fights the enemies and moves on. But look at this wall.\n[SCENE]: The player character walks to the back right corner of the room and attacks a specific, plain-looking wall.\n[SOUND EFFECT: Secret wall crumbling]\nVOICEOVER: A secret passage. This leads you to a whole new area with the Seedbed Curse item needed for the Dung Eater's questline. You're welcome.\nON-SCREEN TEXT: Follow for more secrets.", "tone": "Shocking", "niche": "Gaming", "isNew": true },
    { "id": "dfy-10", "title": "Why Your Cat 'Makes Biscuits' On You", "hook": "Does your cat do this? It's not as random as you think.", "script": "VOICEOVER: You know when your cat does this? Kneading you like dough?\n[SCENE]: Adorable close-up of a cat kneading a soft blanket or a person's lap, purring loudly.\nVOICEOVER: It's called 'making biscuits', and it's a throwback to when they were kittens.\n[SCENE]: A short, cute clip of kittens kneading their mother while nursing.\nON-SCREEN TEXT: Kittenhood Instinct\nVOICEOVER: They did this to stimulate milk flow from their mother. So when they do it to you...\n[SCENE]: Back to the first cat, looking content and sleepy on its owner's lap.\nON-SCREEN TEXT: \"You make me feel safe & loved.\"\nVOICEOVER: ...it means they feel completely safe, comfortable, and they see you as a source of comfort. It's the ultimate compliment.", "tone": "Heartwarming", "niche": "Pets", "isNew": true },
    { "id": "dfy-11", "title": "This Google Flights Hack Will Save You Hundreds", "hook": "Stop booking flights the wrong way. Use this trick instead.", "script": "VOICEOVER: You're about to book a flight, but you're not sure if it's the best price.\n[SCENE]: Screen recording of someone looking at a flight price on Google Flights.\nVOICEOVER: Don't click 'Book' yet. Scroll down and find this little toggle.\n[SCENE]: The screen recording highlights the 'Track prices' toggle switch.\nON-SCREEN TEXT: 'Track prices'\nVOICEOVER: Turn this on. Google will now email you the second the price for your flight drops. I've saved hundreds of dollars by just waiting a few days for the price alert email.\n[SCENE]: Show a fake email notification with the subject 'Price drop for your flight to Tokyo!'.\nON-SCREEN TEXT: Book when the price drops!\nVOICEOVER: It's that easy. Never overpay for a flight again.", "tone": "Educational", "niche": "Travel", "isNew": true },
    { "id": "dfy-12", "title": "Huge Home-Buying Red Flag Hiding in Plain Sight", "hook": "Never buy a house without checking this one thing.", "script": "VOICEOVER: You're at an open house and everything looks perfect. But you could be missing a huge red flag.\n[SCENE]: A person walking through a beautifully staged home.\nVOICEOVER: Ignore the fresh paint and nice furniture. Go to the windows.\n[SCENE]: A close-up of someone trying to open a window. It's stuck or difficult to open. Then a shot of a window with condensation between the panes.\nON-SCREEN TEXT: Check Every Window!\nVOICEOVER: Are they hard to open? Are they fogged up between the panes? That means the seals are broken. Replacing all the windows in a house can cost you over $10,000.\n[SCENE]: A person looking stressed, with a dollar sign flashing over their head.\nVOICEOVER: It's an easy thing to check, and it can save you a fortune. Follow for more home-buying tips.", "tone": "Shocking", "niche": "Real Estate", "isNew": true },
    { "id": "dfy-13", "title": "The 'Benjamin Franklin Effect' Explained in 60s", "hook": "Want someone to like you? Ask them for a small favor.", "script": "VOICEOVER: This sounds backwards, but it works. To get someone to like you, don't do them a favor... ask them to do a small one for you.\n[SCENE]: Person A hesitates, then asks Person B, 'Hey, can I borrow a pen?'. Person B easily agrees and hands one over.\nVOICEOVER: This is the Benjamin Franklin effect. His theory was that someone who has done you a kindness is more likely to do you another one than someone you yourself have obliged.\n[SCENE]: An animation showing Person B's brain. A thought bubble appears: 'I did something nice for Person A. I must like them.'\nON-SCREEN TEXT: Cognitive Dissonance\nVOICEOVER: Their brain justifies the action by subconsciously thinking, 'I wouldn't have done that favor if I didn't like them.' It reduces the cognitive dissonance. So, a small favor can lead to a big change in perception.", "tone": "Data-Driven", "niche": "Psychology", "isNew": true },
    { "id": "dfy-40", "title": "How a 'Sinking Fund' Prevents Financial Emergencies", "hook": "This simple bank account trick will save you from debt.", "script": "VOICEOVER: Stop letting unexpected expenses like car repairs become financial emergencies.\n[SCENE]: A person looking stressed, holding a huge car repair bill with a dramatic red 'PAST DUE' stamp on it.\nON-SCREEN TEXT: The Problem: The 'Oh No!' Fund\nVOICEOVER: Most people have one savings account. It feels painful to use it for a car repair or a new fridge.\n[SCENE]: Show a clean, organized banking app with multiple, named savings accounts: 'Car Repairs: $240', 'Vacation: $500', 'New Laptop: $150'.\nON-SCREEN TEXT: The Solution: Sinking Funds\nVOICEOVER: This is a 'sinking fund'. You create separate savings accounts for specific, future expenses. Every payday, you automatically transfer a small amount into each one. $20 to car repairs, $50 to vacation.\n[SCENE]: The person now pays the car repair bill with a calm expression, easily transferring money from their 'Car Repairs' sinking fund.\nVOICEOVER: Now, when your car breaks down, it's not an emergency. It's just an expense you already planned for. You're not touching your real emergency fund; you're just using the money you set aside for that exact purpose.", "tone": "Educational", "niche": "Personal Finance" },
    { "id": "dfy-15", "title": "The Shocking Truth About 'Zero Calorie' Drinks", "hook": "Are your diet drinks making you gain weight?", "script": "VOICEOVER: You drink zero-calorie sodas to lose weight, but they might be doing the opposite.\n[SCENE]: A hand grabbing a popular diet soda can from a fridge.\nVOICEOVER: Studies show the intense artificial sweeteners in these drinks can trick your brain. \n[SCENE]: An animation of a brain's pleasure center lighting up, then looking confused.\nON-SCREEN TEXT: Craves REAL Sugar\nVOICEOVER: Your brain expects a sugar reward that never comes, which can increase your cravings for actual sugary, high-calorie foods later on. \n[SCENE]: The same person from the start now struggling to resist a donut.\nVOICEOVER: It can disrupt your gut health too. So while it's 'zero calories', it's not 'zero consequence'.", "tone": "Shocking", "niche": "Weight Loss", "isNew": true },
    { "id": "dfy-16", "title": "How Walking 10k Steps ACTUALLY Changes Your Body", "hook": "This is what really happens when you walk 10,000 steps a day.", "script": "VOICEOVER: We all know we should walk more, but what's the big deal?\n[SCENE]: A satisfying time-lapse of a person's daily walk through a park, a city, etc.\nON-SCREEN TEXT: Week 1: Better Mood & Energy\nVOICEOVER: In the first week, you'll notice a boost in your mood from endorphins and better sleep.\n[SCENE]: A shot of someone easily choosing stairs over an escalator.\nON-SCREEN TEXT: Month 1: Improved Heart Health\nVOICEOVER: After a month, your cardiovascular system gets stronger. Your blood pressure can actually decrease.\n[SCENE]: A person looking in the mirror, noticing their clothes fit better.\nON-SCREEN TEXT: Month 3: Noticeable Fat Loss\nVOICEOVER: By month three, combined with a decent diet, you'll see real changes in body composition. It's not about intensity; it's about consistency.", "tone": "Data-Driven", "niche": "Weight Loss", "isNew": true },
    { "id": "dfy-17", "title": "How I Use Canva Templates to Make $500/month", "hook": "This is the laziest way to make money online.", "script": "VOICEOVER: Here's a side hustle for people who aren't creative.\n[SCENE]: Screen recording showing the Canva template marketplace, with lots of social media templates.\nON-SCREEN TEXT: Canva Templates\nVOICEOVER: Go to Canva, and search for template sets - like 'Instagram Carousel Post'. Notice the designs.\n[SCENE]: Screen recording of creating a very simple, clean set of 10 carousel post templates in Canva. Just boxes and text placeholders.\nON-SCREEN TEXT: Create a SIMPLE set of templates\nVOICEOVER: Now, create your own *minimalist* version. Make it super clean and easy to edit. Create a set of 10-15 templates.\n[SCENE]: Screen recording of listing the templates for sale on Etsy or another marketplace for $10.\nON-SCREEN TEXT: List on Etsy for $10\nVOICEOVER: List them on Etsy as a 'Canva Template'. People will buy them, and because it's a digital product, you do the work once and get paid forever. It's that simple.", "tone": "Educational", "niche": "Make Money", "isNew": true },
    { "id": "dfy-18", "title": "Stop Wasting Time on Crunches. Do This Instead.", "hook": "Crunches are the worst way to get abs. Here's what the pros do.", "script": "VOICEOVER: If you're still doing hundreds of crunches, you're wasting your time and hurting your neck.\n[SCENE]: Show someone doing a sloppy crunch with poor form.\n[SOUND EFFECT: Buzzer]\nON-SCREEN TEXT: Strains Your Neck & Back\nVOICEOVER: Crunches only work a tiny part of your abs. For a strong, visible core, you need to do compound movements.\n[SCENE]: Show a person doing a proper plank, with perfect form. Their whole body is shaking.\nON-SCREEN TEXT: DO THIS: Plank (Hold 30-60s)\nVOICEOVER: Start with planks. They engage your entire core, back, and shoulders.\n[SCENE]: Show a person doing hanging leg raises.\nON-SCREEN TEXT: DO THIS: Hanging Leg Raises\nVOICEOVER: Then, master hanging leg raises. They target your lower abs, which are notoriously hard to hit. Work smarter, not harder.", "tone": "Educational", "niche": "Fitness", "isNew": true },
    { "id": "dfy-19", "title": "The Only 3 Stretches You Need After Sitting All Day", "hook": "If you sit at a desk, your body is begging you to do these 3 stretches.", "script": "VOICEOVER: Sitting all day is destroying your posture. Undo the damage with these 3 moves.\n[SCENE]: Person gets up from a desk and performs a deep 'couch stretch' with their back foot up on a chair.\nON-SCREEN TEXT: 1. Hip Flexor Release (30s each side)\nVOICEOVER: First, the couch stretch. Your hips get incredibly tight from sitting. This opens them up and relieves back pain.\n[SCENE]: Person performs a 'doorway stretch', holding onto a doorframe and leaning forward to stretch their chest.\nON-SCREEN TEXT: 2. Doorway Pec Stretch (30s)\nVOICEOVER: Next, the doorway stretch. You're hunched over all day. This opens up your chest and pulls your shoulders back.\n[SCENE]: Person performs a 'thoracic extension' by lying with a foam roller under their upper back and arching over it.\nON-SCREEN TEXT: 3. Thoracic Spine Extension\nVOICEOVER: Finally, get on a foam roller to extend your upper back. This is the antidote to 'tech neck'. Do these daily and feel human again.", "tone": "Educational", "niche": "Fitness", "isNew": true },
    { "id": "dfy-20", "title": "The 'Time Blocking' Method That Doubled My Output", "hook": "I get more done by 10 AM than most people do all day. Here's how.", "script": "VOICEOVER: My to-do list used to own me. Now, I own my day.\n[SCENE]: A shot of a chaotic, messy to-do list with items scribbled everywhere.\nVOICEOVER: The problem with to-do lists is they don't tell you WHEN to do things. The solution is 'time blocking'.\n[SCENE]: A shot of a clean, digital calendar (like Google Calendar) with specific blocks of time color-coded for tasks.\nON-SCREEN TEXT: 9-10 AM: Write Report\nON-SCREEN TEXT: 10-11 AM: Answer Emails\nVOICEOVER: Instead of a list, you schedule tasks directly onto your calendar. Be specific. 'Work on project' becomes 'Draft first 3 pages of report'.\n[SCENE]: A satisfying shot of the person checking off the calendar block, having completed the task.\nVOICEOVER: This forces you to be realistic about what you can achieve and protects you from distractions. You're not just hoping to get things done; you have a plan to do them.", "tone": "Educational", "niche": "Productivity", "isNew": true },
    { "id": "dfy-21", "title": "iPhone Trick: Turn Your Logo into a Secret Button", "hook": "I bet you didn't know your iPhone has a secret button.", "script": "VOICEOVER: Your iPhone has a secret button, and you've been touching it this whole time.\n[SCENE]: A close-up on the back of an iPhone, pointing to the Apple logo.\nVOICEOVER: It's the Apple logo. You can turn it into a shortcut button.\n[SCENE]: Screen recording. Go to Settings -> Accessibility -> Touch -> Back Tap.\nON-SCREEN TEXT: Settings > Accessibility > Touch > Back Tap\nVOICEOVER: You'll see options for 'Double Tap' and 'Triple Tap'.\n[SCENE]: Screen recording. Assign 'Double Tap' to 'Screenshot' and 'Triple Tap' to 'Camera'.\nVOICEOVER: I have mine set to take a screenshot when I double-tap the logo, and open my camera when I triple-tap.\n[SCENE]: A real-life shot of the person double-tapping the back of their phone, and a screenshot animation appears.\nVOICEOVER: It's a game-changer. You're welcome.", "tone": "Educational", "niche": "Tech", "isNew": true },
    { "id": "dfy-22", "title": "The Easiest Way to Perfectly Caulk Your Bathtub", "hook": "Stop using your finger to caulk. Do this instead for perfect lines.", "script": "VOICEOVER: Your caulk line looks like this, doesn't it? A lumpy mess.\n[SCENE]: A close-up of a terrible, messy caulk line around a tub.\nVOICEOVER: Here's the pro-level secret. You need two things: painter's tape and a popsicle stick.\n[SCENE]: Laying down two perfectly straight lines of painter's tape, one on the tub and one on the tile, leaving a small, clean gap.\nON-SCREEN TEXT: 1. Mask with Tape\nVOICEOVER: First, tape off your line. This guarantees your edges are perfect.\n[SCENE]: Apply a bead of caulk, then use the rounded end of a popsicle stick to smooth it in one continuous motion.\nON-SCREEN TEXT: 2. Smooth with Popsicle Stick\nVOICEOVER: Now, use the popsicle stick to create a perfect, concave bead. The excess will smoosh onto the tape.\n[SCENE]: Immediately and carefully peel the tape away, revealing a razor-sharp, perfect caulk line.\nON-SCREEN TEXT: 3. Peel Tape Immediately\nVOICEOVER: Peel the tape while the caulk is still wet. And you get a perfect line, every single time.", "tone": "Educational", "niche": "DIY", "isNew": true },
    { "id": "dfy-23", "title": "The One-Pan Dinner That's Healthy AND Delicious", "hook": "This is my go-to meal when I'm too lazy to cook.", "script": "VOICEOVER: You want to eat healthy, but you hate doing dishes. I get it. This one's for you.\n[SCENE]: A sheet pan. A hand throws on chopped broccoli, bell peppers, and onions.\nON-SCREEN TEXT: Veggies + Olive Oil + Spices\nVOICEOVER: Get a sheet pan. Throw on your favorite veggies. I like broccoli, peppers, and onions. Drizzle with olive oil, salt, pepper, and garlic powder.\n[SCENE]: Add chunks of chicken sausage to the same pan.\nON-SCREEN TEXT: Add Protein (Chicken Sausage)\nVOICEOVER: Now, add a pre-cooked chicken sausage. It's packed with protein and flavor.\n[SCENE]: Put the pan in the oven.\nON-SCREEN TEXT: Bake at 400°F (200°C) for 20-25 Mins\nVOICEOVER: Bake at 400 degrees for about 20 minutes, until the veggies are roasted and the sausage is browned. \n[SCENE]: A beautiful, colorful, finished sheet pan meal. Serve it right out of the pan.\nVOICEOVER: That's it. A delicious, high-protein, low-carb meal with only one pan to clean.", "tone": "Educational", "niche": "Cooking", "isNew": true },
    { "id": "dfy-24", "title": "Fix Your Gaming Lag With This One Windows Setting", "hook": "If your games are lagging, you need to change this one Windows setting.", "script": "VOICEOVER: Your PC is powerful, but your games are still lagging? It might not be your internet.\n[SCENE]: Gameplay footage that is stuttering and lagging badly.\nVOICEOVER: Windows has a setting that's notorious for causing problems. It's called 'Game Mode'.\n[SCENE]: Screen recording. Click Start menu, type 'Game Mode Settings' and open it.\nON-SCREEN TEXT: Search for 'Game Mode Settings'\nVOICEOVER: Search your start menu for 'Game Mode Settings'.\n[SCENE]: The Game Mode toggle is shown in the 'On' position. The cursor moves over and clicks it to 'Off'.\nON-SCREEN TEXT: Turn It OFF\nVOICEOVER: It sounds crazy, but for many systems, turning Game Mode OFF actually improves performance and reduces stuttering. Microsoft's optimization can sometimes conflict with your graphics card drivers.\n[SCENE]: Silky smooth gameplay footage.\nVOICEOVER: Turn it off, restart your PC, and see if it makes a difference. For many, it's a night and day change.", "tone": "Educational", "niche": "Gaming", "isNew": true },
    { "id": "dfy-25", "title": "3 Human Foods That Are Toxic For Your Dog", "hook": "Stop feeding your dog these 3 things immediately.", "script": "VOICEOVER: You love sharing food with your dog, but some human foods can be deadly for them. Here are three to avoid.\n[SCENE]: A shot of grapes and raisins on a kitchen counter.\nON-SCREEN TEXT: 1. Grapes & Raisins\nVOICEOVER: Number one: Grapes and raisins. Even a small amount can cause sudden kidney failure in dogs. It's not worth the risk.\n[SCENE]: A shot of an onion and garlic.\nON-SCREEN TEXT: 2. Onions & Garlic\nVOICEOVER: Number two: Onions and garlic. They can damage your dog's red blood cells, leading to anemia. This includes powders and cooked versions.\n[SCENE]: A shot of a chocolate bar and anything with xylitol (like sugar-free gum).\nON-SCREEN TEXT: 3. Chocolate & Xylitol\nVOICEOVER: And number three, the well-known ones: Chocolate, and especially anything with the artificial sweetener Xylitol. It's extremely toxic to dogs. Check the ingredients on your peanut butter. Share love, not poison.", "tone": "Shocking", "niche": "Pets", "isNew": true },
    { "id": "dfy-26", "title": "How to Pack for a Week in Just a Carry-On", "hook": "I haven't checked a bag in 5 years because of this packing method.", "script": "VOICEOVER: Stop paying for checked bags. Here's how to fit a week's worth of clothes in a carry-on.\n[SCENE]: Laying out clothes on a bed. Person holds up a packing cube.\nON-SCREEN TEXT: Secret Weapon: Packing Cubes\nVOICEOVER: The secret is packing cubes. They compress your clothes and keep you organized.\n[SCENE]: A satisfying time-lapse of rolling clothes tightly, instead of folding them, and fitting them snugly into the packing cubes.\nON-SCREEN TEXT: Roll, Don't Fold\nVOICEOVER: Next, roll every item of clothing as tightly as you can. This saves a massive amount of space and reduces wrinkles.\n[SCENE]: The packing cubes are placed neatly into a carry-on suitcase, like a game of Tetris. There's still room left over.\nON-SCREEN TEXT: The 5-4-3-2-1 Rule\nVOICEOVER: Follow the 5-4-3-2-1 rule: 5 tops, 4 bottoms, 3 pairs of shoes, 2 dresses or jackets, and 1 swimsuit. Everything should be mix-and-match. Now you can travel cheap and easy.", "tone": "Educational", "niche": "Travel", "isNew": true },
    { "id": "dfy-27", "title": "The 'House Hacking' Strategy That Lets You Live for Free", "hook": "How to make your mortgage pay for itself.", "script": "VOICEOVER: What if I told you that you could live in your house for free?\n[SCENE]: A shot of a duplex or a house with a clear 'in-law suite' or basement apartment.\nVOICEOVER: It's called 'house hacking'. Instead of buying a single-family home, you buy a multi-unit property, like a duplex, triplex, or a house with a separate apartment.\n[SCENE]: An animation showing the owner living in one unit, and rent money coming in from the other units.\nON-SCREEN TEXT: Your Mortgage: $2000/mo\nON-SCREEN TEXT: Rent from other units: $2200/mo\nVOICEOVER: You live in one unit and rent out the others. In many cases, the rent from the other units is enough to cover your entire mortgage payment, plus some extra cash flow.\n[SCENE]: A person looking relaxed and happy in their home.\nVOICEOVER: You're building equity in a property, and your tenants are paying for it. It's the ultimate real estate cheat code.", "tone": "Make Money", "niche": "Real Estate", "isNew": true },
    { "id": "dfy-28", "title": "How to Instantly Spot a Liar (According to the FBI)", "hook": "This is how FBI agents know you're lying.", "script": "VOICEOVER: Want to know if someone is lying? The FBI looks for these clusters of behavior.\n[SCENE]: A split screen. On one side, a person is calm. On the other, they look nervous.\nVOICEOVER: First, watch for changes in their baseline. If a calm person suddenly gets fidgety when you ask a specific question, that's a red flag.\n[SCENE]: A close-up on someone's eyes. They are looking up and to the left, then quickly away.\nON-SCREEN TEXT: Breaking Eye Contact at Key Moments\nVOICEOVER: Second, they'll often break eye contact at the exact moment they tell the lie. They look away to think.\n[SCENE]: A person is talking, but their hands are hidden under a table or in their pockets.\nON-SCREEN TEXT: Hiding Their Hands\nVOICEOVER: Third, they may hide their hands. It's a subconscious sign of hiding something. One sign means nothing, but a cluster of them... means you should dig deeper.", "tone": "Educational", "niche": "Psychology", "isNew": true },
    { "id": "dfy-29", "title": "The Roth IRA Explained for Dummies (in 60s)", "hook": "Every 20-year-old needs to open this account right now.", "script": "VOICEOVER: Here's how to become a tax-free millionaire, explained in 60 seconds.\n[SCENE]: An animation of a piggy bank with 'ROTH IRA' written on it.\nVOICEOVER: It's called a Roth IRA. It's a special retirement account.\n[SCENE]: An animation of money with a small tax symbol on it going into the piggy bank.\nON-SCREEN TEXT: Pay Taxes NOW\nVOICEOVER: You put money in that you've already paid taxes on. Up to $7,000 a year.\n[SCENE]: Inside the piggy bank, the money grows and multiplies with a chart arrow going up dramatically over 40 years.\nON-SCREEN TEXT: Grows 100% TAX-FREE\nVOICEOVER: That money then grows completely, 100% tax-free for the rest of your life.\n[SCENE]: An older, happy person pulling huge bags of money out of the piggy bank with NO tax symbol on them.\nON-SCREEN TEXT: Withdraw 100% TAX-FREE\nVOICEOVER: When you retire, you can pull out every single penny, including all the growth, without paying a dime in taxes. The government will never touch it again. Open one yesterday.", "tone": "Educational", "niche": "Personal Finance", "isNew": true },
    { "id": "dfy-30", "title": "This FREE Steam Game is Better Than Most AAA Titles", "hook": "This game on Steam is free, and it's a masterpiece.", "script": "VOICEOVER: Stop paying $70 for broken games. I'm about to show you a free game that's better than most new releases.\n[SCENE]: Show the Steam store page for 'The Finals'.\nON-SCREEN TEXT: The Game: 'The Finals'\nVOICEOVER: The game is called 'The Finals'. It's a fast-paced, team-based shooter where the arenas are completely destructible.\n[SCENE]: High-action gameplay clips showing buildings collapsing, players using zip lines and jump pads.\nVOICEOVER: You can blow up walls, ceilings, entire buildings. Every match is pure chaos and incredibly fun. It has a unique 'cash out' game mode that's way more interesting than just getting kills.\n[SCENE]: A team successfully 'cashes out' a vault, with money effects everywhere.\nVOICEOVER: It's free-to-play, and it's not pay-to-win. There is no reason not to try it.", "tone": "Action-Packed", "niche": "Gaming", "isNew": true },
    { "id": "dfy-31", "title": "Is Your Phone Listening? The Creepy Truth.", "hook": "Ever talked about something then seen an ad for it? Here's what's really happening.", "script": "VOICEOVER: You think your phone is listening to your conversations. You're both right and wrong.\n[SCENE]: A person talking to a friend about 'cat food'. Later, they are on their phone and see an ad for cat food.\nVOICEOVER: Your phone isn't *literally* recording your voice 24/7. That's illegal and would use way too much data.\n[SCENE]: An animation showing interconnected data points: your location, your friend's search history, your age, your recent purchases.\nON-SCREEN TEXT: It's About Data Correlation\nVOICEOVER: The truth is scarier. Tech companies know who you are, who your friends are, where you go, what you search for. If you're physically near your friend, and they recently searched for 'best cat food' on their phone, the algorithm assumes you might be interested too because you're in the same social and physical circle. \n[SCENE]: A person looking creeped out by their phone.\nVOICEOVER: They don't need to listen. They just connect the dots.", "tone": "Shocking", "niche": "Tech", "isNew": true },
    { "id": "dfy-32", "title": "The Toddler Tantrum 'Whisper Trick'", "hook": "Your toddler is screaming. Don't yell back. Whisper.", "script": "VOICEOVER: Your toddler is having a full-blown meltdown in public. Your first instinct is to raise your voice.\n[SCENE]: A parent looking stressed while a toddler has a tantrum (can be implied, not shown).\nVOICEOVER: Don't. Get down on their level, make eye contact, and whisper.\n[SCENE]: A parent kneeling down, speaking very softly and calmly to a child.\nON-SCREEN TEXT: Whisper: \"I can't hear you when you're screaming, can you tell me in your quiet voice?\"\nVOICEOVER: This does two things. It forces them to quiet down to hear you, and it de-escalates the situation. Their curiosity overrides their anger. You're not matching their energy; you're changing it. It's a pattern interrupt. Try it.", "tone": "Educational", "niche": "Parenting", "isNew": true },
    { "id": "dfy-33", "title": "Relatable Parent Moment: The 'Snack Dealer'", "hook": "POV: You're a parent on a 10-minute car ride.", "script": "[SCENE]: A parent is driving. The camera is on them. They look tired.\n[SOUND: A child's voice from off-screen, whining 'I'm hungry!']\n[SCENE]: The parent, without looking away from the road, reaches into a comically large bag in the passenger seat.\n[SOUND: Rustling of snack bags]\n[SCENE]: The parent pulls out a bag of Goldfish crackers and passes it to the back seat.\n[SOUND: A child's voice, 'I don't want that one!']\n[SCENE]: The parent's eye twitches slightly. They reach back into the bag and pull out an applesauce pouch, passing it back.\n[SOUND: A child's voice, 'Can I have juice?']\nON-SCREEN TEXT: I am a chauffeur and a 24/7 snack dealer.\n[SCENE]: The parent just sighs and keeps driving.", "tone": "Funny", "niche": "Parenting", "isNew": true },
    { "id": "dfy-34", "title": "The 'Connection Before Correction' Rule", "hook": "Stop saying 'Stop crying!' to your kids. Do this instead.", "script": "VOICEOVER: When your child is upset, your goal isn't to stop the emotion. It's to help them process it.\n[SCENE]: A child is crying over a broken toy.\n[ON-SCREEN TEXT - What NOT to say]: \"It's just a toy, stop crying.\"\nVOICEOVER: Saying 'stop crying' tells them their feelings are wrong. Instead, try 'Connection Before Correction.'\n[SCENE]: A parent gets down to the child's level and hugs them.\n[ON-SCREEN TEXT - What TO say]: \"You're so sad that your toy broke. I understand. It's okay to be sad.\"\nVOICEOVER: First, validate the feeling. Connect with them emotionally. Only after they feel heard and understood can you move on to problem-solving.\nON-SCREEN TEXT: First feel, then fix.\nVOICEOVER: This builds emotional intelligence and trust.", "tone": "Heartwarming", "niche": "Parenting", "isNew": true },
    { "id": "dfy-35", "title": "Your Dirty Wheels Are Begging For This", "hook": "This one product will make your dirty wheels look brand new.", "script": "[SCENE]: A super close-up shot of a car wheel caked in black brake dust and grime.\n[SOUND: Grimy, gritty sound]\nVOICEOVER: Your wheels look like this, don't they? Don't use a generic car soap.\n[SCENE]: A hand sprays a thick, colorful 'Iron Remover' product onto the wheel. It immediately starts to turn deep purple/red as it reacts with the iron particles.\nON-SCREEN TEXT: Use an Iron Remover\nVOICEOVER: This is an iron remover. It chemically dissolves the baked-on brake dust that normal soaps can't touch. See it turning purple? That's it working.\n[SCENE]: A pressure washer easily blasts away the purple liquid, revealing a sparkling clean wheel underneath. The before/after is dramatic.\n[SOUND: Satisfying pressure washer sounds]\nVOICEOVER: Let it sit for a minute, then rinse. No heavy scrubbing needed. The results speak for themselves.", "tone": "Educational", "niche": "Car Detailing", "isNew": true },
    { "id": "dfy-36", "title": "The Pro Secret to 'New Car' Interior Plastic", "hook": "Don't use those greasy Armor All wipes. Here's what the pros use.", "script": "VOICEOVER: You want your car's interior to look new, not like a greasy slip-n-slide.\n[SCENE]: A shot of a car dashboard that's unnaturally shiny and greasy from a cheap protectant wipe.\n[SOUND: Squeaky, oily sound]\nVOICEOVER: Those shiny protectants attract dust and can crack your dash over time.\n[SCENE]: A hand holding a bottle of 'All-Purpose Cleaner' and a detail brush.\nON-SCREEN TEXT: Step 1: Clean with APC\nVOICEOVER: First, clean the plastic with a good All-Purpose Cleaner and a soft brush to remove the old grime.\n[SCENE]: Wipe the plastic clean with a microfiber towel. Then, apply a small amount of a water-based, matte-finish interior dressing to a new applicator pad.\nON-SCREEN TEXT: Step 2: Use a Matte Finish Dressing\nVOICEOVER: Now, the secret. Use a quality, water-based dressing. It should leave a satin, OEM finish, not a greasy shine. It nourishes the plastic and has UV protection.\n[SCENE]: A beautiful shot of the finished dashboard. It looks clean, dark, and factory-new, not shiny.\nON-SCREEN TEXT: Clean & Protected. Not Greasy.", "tone": "Educational", "niche": "Car Detailing", "isNew": true },
    { "id": "dfy-37", "title": "STOP Washing Your Car With Dish Soap!", "hook": "If you're washing your car with dish soap, you need to see this.", "script": "VOICEOVER: You think you're saving money by using dish soap to wash your car? You're actually destroying your paint.\n[SCENE]: A person squirting Dawn dish soap into a bucket of water.\n[SOUND: BUZZER]\nVOICEOVER: Dish soap is a degreaser. It's designed to strip everything off a surface, including the wax and sealant that protect your car's clear coat.\n[SCENE]: An animation showing a protective wax layer on a car's paint being stripped away, exposing the clear coat to sun and rain icons.\nON-SCREEN TEXT: Strips Wax & Sealant!\nVOICEOVER: Without that protection, the sun's UV rays will cause your paint to fade and oxidize way faster.\n[SCENE]: A shot of a faded, oxidized car hood.\nVOICEOVER: Always use a pH-neutral car-specific shampoo. It's designed to clean the dirt without stripping the protection. Your paint will thank you.", "tone": "Shocking", "niche": "Car Detailing", "isNew": true },
    { "id": "dfy-38", "title": "The 5-Minute Rule That Will Save Your Relationship", "hook": "This communication hack is so simple, but it's a game-changer.", "script": "VOICEOVER: Every couple has the same recurring arguments. Here's how to stop them.\n[SCENE]: A couple looking frustrated, sitting on opposite ends of a couch.\nVOICEOVER: It's called the '5-Minute Rule.' When you have a disagreement, one person talks for up to 5 minutes without interruption. The other person's ONLY job is to listen.\n[SCENE]: Person A is talking. Person B is actively listening, nodding, not preparing their rebuttal.\nON-SCREEN TEXT: Person A: Talks (5 Mins)\nON-SCREEN TEXT: Person B: ONLY Listens\nVOICEOVER: After 5 minutes, you switch roles. This forces you to actually hear your partner's perspective instead of just waiting for your turn to talk. It's about understanding, not winning. \n[SCENE]: The couple now looks calmer, maybe sitting closer.\nON-SCREEN TEXT: Understand, don't just reply.\nVOICEOVER: You'll be amazed at what you learn.", "tone": "Educational", "niche": "Relationships", "isNew": true },
    { "id": "dfy-39", "title": "This 'Green Flag' Is Better Than 'I Love You'", "hook": "This is the biggest green flag in a relationship, and it's not what you think.", "script": "VOICEOVER: Flowers and compliments are nice. But this is what a healthy, secure relationship looks like.\n[SCENE]: Person A is excited, talking about a new hobby or accomplishment they achieved on their own.\nVOICEOVER: It's when your partner celebrates your individual successes, without any jealousy or insecurity.\n[SCENE]: Person B is listening intently, smiling, and looks genuinely happy FOR Person A. They give a high-five or a hug.\nON-SCREEN TEXT: They are your biggest cheerleader, not your competition.\nVOICEOVER: They aren't threatened by your growth; they're excited by it. They push you to be better, even in areas that don't involve them. \n[SCENE]: A shot of the couple, happy and supportive.\nVOICEOVER: Find someone who claps when you win. That's the real prize.", "tone": "Heartwarming", "niche": "Relationships", "isNew": true },
    { "id": "dfy-41", "title": "The Difference Between Privacy and Secrecy", "hook": "There's a huge difference between privacy and secrecy in a relationship.", "script": "VOICEOVER: Let's talk about a major relationship red flag that people often confuse.\n[SCENE]: Person A is writing in a private journal. Person B walks by, smiles, and gives them their space.\nON-SCREEN TEXT: PRIVACY: Having a personal world.\nVOICEOVER: Privacy is having your own thoughts, your own friends, your own space. It's healthy and necessary. Your partner respects it because they trust you.\n[SCENE]: Person C is on their phone, and when Person D walks into the room, they quickly angle the phone away or close the app.\nON-SCREEN TEXT: SECRECY: Hiding a world from your partner.\nVOICEOVER: Secrecy is actively concealing information because you know your partner would be hurt by it. It's about hiding things *from* them. It breeds suspicion and kills trust.\n[SCENE]: A split screen showing the two scenarios.\nVOICEOVER: Privacy is about autonomy. Secrecy is about avoidance and fear. Know the difference.", "tone": "Shocking", "niche": "Relationships", "isNew": true },
    { "id": "dfy-42", "title": "Stoicism in 60 Seconds", "hook": "How to be happier using a 2000-year-old philosophy.", "script": "VOICEOVER: You're stressed about things you can't control. Let's fix that with Stoicism.\n[SCENE]: An animation of a circle. Inside the circle are things like 'My Actions', 'My Effort', 'My Attitude'. Outside the circle are 'The Weather', 'Traffic', 'Other People's Opinions'.\nON-SCREEN TEXT: Circle of Control\nVOICEOVER: The core idea is simple: separate what you can control from what you can't. You can't control the traffic, but you can control your reaction to it.\n[SCENE]: A person stuck in traffic. First, they are angry. Then, they take a deep breath and put on a podcast, looking calm.\nVOICEOVER: Instead of wasting energy on what's outside your circle, focus 100% of your effort on what's inside. Your actions, your choices, your character.\n[SCENE]: A person looking calm and content.\nON-SCREEN TEXT: Don't desire for things to happen as you wish, but wish for them to happen as they do, and you will be happy.\nVOICEOVER: That's it. That's the key to tranquility.", "tone": "Educational", "niche": "Philosophy", "isNew": true },
    { "id": "dfy-43", "title": "The 'Ship of Theseus' Paradox Will Break Your Brain", "hook": "This ancient thought experiment makes you question everything.", "script": "VOICEOVER: Are you the same person you were 10 years ago? Let's find out.\n[SCENE]: An animation of an old wooden ship, the 'Ship of Theseus'.\nVOICEOVER: The hero Theseus has a ship. Over the years, as the wooden planks rot, they are replaced one by one, until no original planks remain. \n[SCENE]: The animation shows planks being replaced until the ship is entirely new wood.\nON-SCREEN TEXT: Question 1: Is this still the Ship of Theseus?\nVOICEOVER: Most people say yes. But now...\n[SCENE]: An animation of someone gathering up all the old, rotted planks and reassembling them.\nON-SCREEN TEXT: Question 2: Which one is the REAL Ship of Theseus?\nVOICEOVER: Now you have two ships. The one that was repaired, and the one built from the original parts. Which one is the true ship? The same applies to you. Every cell in your body is replaced over about 7 years. Your thoughts and beliefs change.\n[SCENE]: A person looking into a mirror, and their reflection is a younger version of themself.\nVOICEOVER: So... are you still you?", "tone": "Shocking", "niche": "Philosophy", "isNew": true },
    { "id": "dfy-44", "title": "Sisyphus and the Modern 9-to-5", "hook": "Feeling like your job is pointless? The ancient Greeks had a myth for that.", "script": "VOICEOVER: You know the Greek myth of Sisyphus? He was condemned to push a boulder up a hill, only to watch it roll back down, for eternity.\n[SCENE]: An animation of Sisyphus pushing the boulder.\nVOICEOVER: Sounds a lot like a pointless job, right? Answering the same emails, doing the same tasks, day after day.\n[SCENE]: A quick montage of boring office work: typing, meetings, etc.\nVOICEOVER: But the philosopher Albert Camus had a different take. He said we must imagine Sisyphus happy.\n[SCENE]: The animation of Sisyphus now shows him smiling as he pushes the boulder.\nON-SCREEN TEXT: 'The struggle itself... is enough to fill a man's heart.' - Camus\nVOICEOVER: His happiness doesn't come from reaching the top. It comes from finding meaning and rebellion in the struggle itself. He embraces the absurdity of his task and finds freedom in it.\n[SCENE]: A shot of a person at their desk, but now they look focused and find small joy in their task.\nVOICEOVER: So maybe the point isn't the outcome. Maybe it's how you approach the push.", "tone": "Inspirational", "niche": "Philosophy", "isNew": true },
    { "id": "dfy-45", "title": "The Historical Event That Sounds Fake But Isn't", "hook": "In 1518, hundreds of people danced themselves to death.", "script": "VOICEOVER: This is one of the weirdest events in history. It's called the Dancing Plague of 1518.\n[SCENE]: A medieval-style drawing or animation of people dancing manically in a town square.\nVOICEOVER: In Strasbourg, a woman named Frau Troffea started dancing in the street. She didn't stop. Within a week, 34 others had joined her.\n[SCENE]: The group of dancers grows larger and more frantic.\nON-SCREEN TEXT: Strasbourg, 1518\nVOICEOVER: Within a month, there were 400 people dancing. They couldn't stop. Doctors at the time said it was 'hot blood' and prescribed... more dancing. They even built them a stage.\n[SCENE]: The authorities look confused, then gesture towards a wooden stage.\nVOICEOVER: People started dying from heart attacks, strokes, and exhaustion. The plague eventually ended, but to this day, no one is 100% sure why it started. Mass hysteria? A strange disease? We may never know.", "tone": "Shocking", "niche": "History", "isNew": true },
    { "id": "dfy-46", "title": "Why The Roman Empire Didn't Use The Number Zero", "hook": "The Romans built aqueducts and conquered the world, but they were missing this one number.", "script": "VOICEOVER: Look at Roman numerals. I, V, X, L, C, D, M. What's missing?\n[SCENE]: Roman numerals being written on a stone tablet.\nVOICEOVER: There's no zero. The Romans, masters of engineering, had no concept for the number zero as a placeholder or a value. \n[SCENE]: An animation showing a Roman trying to do complex math and getting frustrated.\nON-SCREEN TEXT: How did they do math?\nVOICEOVER: They used an abacus for calculations, where an empty column represented zero. But it wasn't a number they wrote down. The concept of zero as a number was developed in India and introduced to Europe much later by Arab traders.\n[SCENE]: A map showing the concept of Zero traveling from India to the Middle East to Europe.\nVOICEOVER: So while the Romans were building the Colosseum, they were doing it with math that was way harder than it needed to be.", "tone": "Educational", "niche": "History", "isNew": true },
    { "id": "dfy-47", "title": "The Great Emu War: When Australia Lost a War to Birds", "hook": "Did you know the Australian military once declared war on birds... and lost?", "script": "VOICEOVER: It's 1932. Post-WWI soldiers in Western Australia are having their crops destroyed by 20,000 emus.\n[SCENE]: A black and white photo of a massive flock of emus on a farm.\nVOICEOVER: So the farmers, who are army veterans, request military assistance. And they get it.\n[SCENE]: A real historical photo of soldiers with machine guns facing off against emus.\nON-SCREEN TEXT: The Great Emu War\nVOICEOVER: The military deployed soldiers with two Lewis machine guns to hunt the emus. But the emus were too smart. They were fast, they'd split into small groups, and were surprisingly resilient to bullets.\n[SCENE]: Comical animation of emus dodging bullets, Matrix-style.\nVOICEOVER: After using thousands of rounds of ammunition, the army had only killed a few dozen emus. It was a complete failure. The officer in charge was quoted as saying, 'If we had a military division with the bullet-carrying capacity of these birds it would face any army in the world.'\n[SCENE]: A picture of an emu looking smug.\nVOICEOVER: The birds had won.", "tone": "Funny", "niche": "History", "isNew": true },
    { "id": "dfy-48", "title": "How to Answer 'What's Your Biggest Weakness?'", "hook": "Stop saying 'I'm a perfectionist' in job interviews. Here's what to say instead.", "script": "VOICEOVER: The interviewer asks, 'What's your biggest weakness?' It's a trap. Don't fall for it.\n[SCENE]: An interviewee looking nervous in front of an interviewer.\n[ON-SCREEN TEXT - Bad Answer]: 'I work too hard.' or 'I'm a perfectionist.'\nVOICEOVER: They see right through that. Here's the formula: State a REAL, minor weakness. Explain how you're actively working on it. And turn it into a strength.\n[SCENE]: A confident interviewee speaking.\n[ON-SCREEN TEXT - Good Answer]: 'In the past, I've sometimes focused too much on a single project, which can affect my multitasking. To combat this, I've become an expert in using project management tools like Asana to prioritize tasks and manage my time effectively across multiple projects.'\nVOICEOVER: You were honest, showed self-awareness, and demonstrated a problem-solving attitude. You're hired.", "tone": "Educational", "niche": "Career", "isNew": true },
    { "id": "dfy-49", "title": "The Salary Negotiation Phrase That's Worth Thousands", "hook": "Never accept the first salary offer. Use this phrase instead.", "script": "VOICEOVER: You got the job offer! You're excited. But the salary is a little lower than you hoped.\n[SCENE]: A person looking at a job offer email, looking slightly disappointed.\nVOICEOVER: Don't just accept it. And don't give a demanding counter-offer. Use this magic phrase.\n[SCENE]: A person on the phone with the recruiter, looking confident.\nON-SCREEN TEXT: 'Thank you so much for the offer, I'm very excited about the role. Based on my research of the market rate for this position and my level of experience, I was expecting a salary closer to [Your Higher Number]. Is there any flexibility on the compensation?'\nVOICEOVER: This is powerful because it's polite, it's based on 'market research' (not just what you want), and it asks a collaborative question, 'Is there any flexibility?'. It opens a negotiation instead of creating a conflict.\nON-SCREEN TEXT: Don't demand. Inquire.\nVOICEOVER: Most of the time, they have a range they can work with, and this is how you unlock it.", "tone": "Educational", "niche": "Career", "isNew": true },
    { "id": "dfy-50", "title": "How to Get Promoted Faster (The 'Visibility' Trick)", "hook": "Just doing good work isn't enough to get promoted. You need to do this.", "script": "VOICEOVER: You're working hard, but no one seems to notice. Let's fix that.\n[SCENE]: A person working late at their desk, but the office is empty and dark.\nVOICEOVER: The problem isn't your work; it's your work's visibility. You need to create a 'brag document.'\n[SCENE]: A simple document (like a Google Doc) with bullet points.\nON-SCREEN TEXT: My 'Wins' - Q3\nVOICEOVER: It's a running list of your accomplishments. Every week, add 1-3 bullet points. 'Launched X project which resulted in Y.' 'Solved Z problem for the team.' 'Received positive feedback from client A.'\n[SCENE]: The person is in a performance review with their manager, confidently referencing their brag document.\nVOICEOVER: Now, when it's time for your performance review, you're not trying to remember what you did 6 months ago. You have a documented list of your value to the company. It makes it easy for your boss to justify your promotion.\nON-SCREEN TEXT: Document your value.\nVOICEOVER: Make their job easier, and they'll make your career better.", "tone": "Data-Driven", "niche": "Career", "isNew": true }
]
